In [2]:
import numpy as np
import pandas as pd

In [5]:
two_dimensional_list = [['Taylor Swift', 'December 13, 1989', 'Singer-songwriter'],
                        ['Aaron Sorkin', 'June 9, 1961', 'Screenwriter'],
                        ['Harry Potter', 'July 31, 1980', 'Wizard'],
                        ['Ji-Sung Park', 'February 25, 1981', 'Footballer']]

In [6]:
two_dimensional_array = np.array(two_dimensional_list)

In [18]:
list_of_series = [
    pd.Series(['Taylor Swift', 'December 13, 1989', 'Singer-songwriter']),
    pd.Series(['Aaron Sorkin', 'June 9, 1961', 'Screenwriter']),
    pd.Series(['Harry Potter', 'July 31, 1980', 'Wizard']),
    pd.Series(['Ji-Sung Park', 'February 25, 1981', 'Footballer'])
]

In [13]:
df1 = pd.DataFrame(two_dimensional_list, columns = ['name', 'brithday','occupation'])
df1

           name           brithday         occupation
0  Taylor Swift  December 13, 1989  Singer-songwriter
1  Aaron Sorkin       June 9, 1961       Screenwriter
2  Harry Potter      July 31, 1980             Wizard
3  Ji-Sung Park  February 25, 1981         Footballer

In [15]:
df2 = pd.DataFrame(two_dimensional_array, columns = ['name', 'brithday','occupation'])
df2

           name           brithday         occupation
0  Taylor Swift  December 13, 1989  Singer-songwriter
1  Aaron Sorkin       June 9, 1961       Screenwriter
2  Harry Potter      July 31, 1980             Wizard
3  Ji-Sung Park  February 25, 1981         Footballer

In [23]:
df3 = pd.DataFrame(list_of_series)
df3.columns = [['name', 'brithday','occupation']]
df3

           name           brithday         occupation
0  Taylor Swift  December 13, 1989  Singer-songwriter
1  Aaron Sorkin       June 9, 1961       Screenwriter
2  Harry Potter      July 31, 1980             Wizard
3  Ji-Sung Park  February 25, 1981         Footballer